<?php

return [

    /*
    |--------------------------------------------------------------------------
    | List of roles
    |--------------------------------------------------------------------------
    |
    |
    |
    */

    'roles' => [
        1 => 'Вр', 'КЗЛ', 'ЦЗ', 'КЗП', 'ОП', 'КПЛ', 'ЦП', 'КПП', 'АП', 'ОФ', 'КФЛ', 'ЦФ', 'КФП',
    ],

    /*
    |--------------------------------------------------------------------------
    | List of areas of roles
    |--------------------------------------------------------------------------
    |
    | Coordinates of areas of roles on a field.
    |
    */

    'role_areas' => [
        'Вр' => [
            'x' => [0, 142],
            'y' => [151, 449],
        ],
        'КЗЛ' => [
            'x' => [0, 333],
            'y' => [450, 600],
        ],
        'ЦЗ' => [
            'x' => [143, 285],
            'y' => [151, 449],
        ],
        'КЗП' => [
            'x' => [0, 333],
            'y' => [0, 150],
        ],
        'ОП' => [
            'x' => [286, 428],
            'y' => [151, 449],
        ],
        'КПЛ' => [
            'x' => [334, 667],
            'y' => [450, 600],
        ],
        'ЦП' => [
            'x' => [429, 571],
            'y' => [151, 449],
        ],
        'КПП' => [
            'x' => [334, 667],
            'y' => [0, 150],
        ],
        'АП' => [
            'x' => [572, 714],
            'y' => [151, 449],
        ],
        'ОФ' => [
            'x' => [715, 857],
            'y' => [151, 449],
        ],
        'КФЛ' => [
            'x' => [668, 1000],
            'y' => [450, 600],
        ],
        'ЦФ' => [
            'x' => [858, 1000],
            'y' => [151, 449],
        ],
        'КФП' => [
            'x' => [668, 1000],
            'y' => [0, 150],
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Roles' data
    |--------------------------------------------------------------------------
    |
    |
    |
    */

    'roles_data' => [
        'Вр' => [
            'count' => 2,
            'additional_roles' => [],
            'data_range' => [
                'speed' => [10, 50],
                'acceleration' => [10, 50],
                'coordination' => [30, 60],
                'power' => [30, 60],
                'accuracy' => [10, 50],
                'vision' => [10, 50],
                'reaction' => [30, 60],
                'in_gate' => [30, 60],
                'on_out' => [30, 60],
            ],
            'default_position' => [
                [
                    'x' => 71,
                    'y' => 300,
                ],
            ],
        ],
        'КЗЛ' => [
            'count' => 1,
            'additional_roles' => ['ЦЗ', 'КЗП', 'КПЛ'],
            'data_range' => [
                'speed' => [30, 60],
                'acceleration' => [30, 60],
                'coordination' => [30, 60],
                'power' => [10, 50],
                'accuracy' => [10, 50],
                'vision' => [10, 50],
                'reaction' => [30, 60],
                'in_gate' => [1, 10],
                'on_out' => [1, 10],
            ],
            'default_position' => [
                [
                    'x' => 214,
                    'y' => 525,
                ],
            ],
        ],
        'ЦЗ' => [
            'count' => 3,
            'additional_roles' => ['КЗЛ', 'КЗП', 'ОП'],
            'data_range' => [
                'speed' => [10, 50],
                'acceleration' => [10, 50],
                'coordination' => [30, 60],
                'power' => [30, 60],
                'accuracy' => [10, 50],
                'vision' => [10, 50],
                'reaction' => [30, 60],
                'in_gate' => [1, 10],
                'on_out' => [1, 10],
            ],
            'default_position' => [
                [
                    'x' => 214,
                    'y' => 375,
                ],
                [
                    'x' => 214,
                    'y' => 225,
                ],
            ],
        ],
        'КЗП' => [
            'count' => 1,
            'additional_roles' => ['ЦЗ', 'КЗЛ', 'КПП'],
            'data_range' => [
                'speed' => [30, 60],
                'acceleration' => [30, 60],
                'coordination' => [30, 60],
                'power' => [10, 50],
                'accuracy' => [10, 50],
                'vision' => [10, 50],
                'reaction' => [30, 60],
                'in_gate' => [1, 10],
                'on_out' => [1, 10],
            ],
            'default_position' => [
                [
                    'x' => 214,
                    'y' => 75,
                ],
            ],
        ],
        'ОП' => [
            'count' => 1,
            'additional_roles' => ['ЦЗ', 'ЦП'],
            'data_range' => [
                'speed' => [30, 60],
                'acceleration' => [10, 50],
                'coordination' => [30, 60],
                'power' => [30, 60],
                'accuracy' => [10, 50],
                'vision' => [10, 50],
                'reaction' => [30, 60],
                'in_gate' => [1, 10],
                'on_out' => [1, 10],
            ],
        ],
        'КПЛ' => [
            'count' => 1,
            'additional_roles' => ['ЦП', 'КЗЛ', 'КПП'],
            'data_range' => [
                'speed' => [30, 60],
                'acceleration' => [30, 60],
                'coordination' => [30, 60],
                'power' => [10, 50],
                'accuracy' => [10, 50],
                'vision' => [10, 50],
                'reaction' => [30, 60],
                'in_gate' => [1, 10],
                'on_out' => [1, 10],
            ],
            'default_position' => [
                [
                    'x' => 500,
                    'y' => 525,
                ],
            ],
        ],
        'ЦП' => [
            'count' => 2,
            'additional_roles' => ['ОП', 'АП'],
            'data_range' => [
                'speed' => [20, 60],
                'acceleration' => [20, 50],
                'coordination' => [20, 60],
                'power' => [20, 60],
                'accuracy' => [20, 60],
                'vision' => [20, 60],
                'reaction' => [20, 50],
                'in_gate' => [1, 10],
                'on_out' => [1, 10],
            ],
            'default_position' => [
                [
                    'x' => 500,
                    'y' => 375,
                ],
                [
                    'x' => 500,
                    'y' => 225,
                ],
            ],
        ],
        'КПП' => [
            'count' => 1,
            'additional_roles' => ['ЦП', 'КЗП', 'КПЛ'],
            'data_range' => [
                'speed' => [30, 60],
                'acceleration' => [30, 60],
                'coordination' => [30, 60],
                'power' => [10, 50],
                'accuracy' => [10, 50],
                'vision' => [10, 50],
                'reaction' => [30, 60],
                'in_gate' => [1, 10],
                'on_out' => [1, 10],
            ],
            'default_position' => [
                [
                    'x' => 500,
                    'y' => 75,
                ],
            ],
        ],
        'АП' => [
            'count' => 1,
            'additional_roles' => ['ЦП', 'ОФ'],
            'data_range' => [
                'speed' => [20, 60],
                'acceleration' => [20, 60],
                'coordination' => [20, 60],
                'power' => [20, 50],
                'accuracy' => [20, 60],
                'vision' => [30, 60],
                'reaction' => [20, 50],
                'in_gate' => [1, 10],
                'on_out' => [1, 10],
            ],
        ],
        'ОФ' => [
            'count' => 1,
            'additional_roles' => ['ЦФ', 'АП'],
            'data_range' => [
                'speed' => [30, 60],
                'acceleration' => [30, 60],
                'coordination' => [30, 60],
                'power' => [20, 50],
                'accuracy' => [20, 60],
                'vision' => [20, 50],
                'reaction' => [20, 50],
                'in_gate' => [1, 10],
                'on_out' => [1, 10],
            ],
            'default_position' => [
                [
                    'x' => 786,
                    'y' => 300,
                ],
            ],
        ],
        'КФЛ' => [
            'count' => 1,
            'additional_roles' => ['ЦФ', 'КПЛ', 'КФП'],
            'data_range' => [
                'speed' => [30, 60],
                'acceleration' => [30, 60],
                'coordination' => [30, 60],
                'power' => [10, 50],
                'accuracy' => [20, 60],
                'vision' => [10, 50],
                'reaction' => [20, 60],
                'in_gate' => [1, 10],
                'on_out' => [1, 10],
            ],
        ],
        'ЦФ' => [
            'count' => 1,
            'additional_roles' => ['ОФ'],
            'data_range' => [
                'speed' => [20, 60],
                'acceleration' => [20, 60],
                'coordination' => [20, 60],
                'power' => [30, 60],
                'accuracy' => [30, 60],
                'vision' => [20, 50],
                'reaction' => [30, 60],
                'in_gate' => [1, 10],
                'on_out' => [1, 10],
            ],
            'default_position' => [
                [
                    'x' => 929,
                    'y' => 300,
                ],
            ],
        ],
        'КФП' => [
            'count' => 1,
            'additional_roles' => ['ЦФ', 'КПП', 'КФЛ'],
            'data_range' => [
                'speed' => [30, 60],
                'acceleration' => [30, 60],
                'coordination' => [30, 60],
                'power' => [10, 50],
                'accuracy' => [20, 60],
                'vision' => [10, 50],
                'reaction' => [20, 60],
                'in_gate' => [1, 10],
                'on_out' => [1, 10],
            ],
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Maximum number of additional roles
    |--------------------------------------------------------------------------
    |
    |
    |
    */

    'additional_roles_max_count' => 1,

    /*
    |--------------------------------------------------------------------------
    | Number of players on the field
    |--------------------------------------------------------------------------
    |
    |
    |
    */

    'on_field_count' => 11,

    /*
    |--------------------------------------------------------------------------
    | List of names
    |--------------------------------------------------------------------------
    |
    |
    |
    */

    'names' => [
        'Абрам', 'Авангард', 'Август', 'Августин', 'Авдей', 'Авенир', 'Аверкий', 'Авксентий', 'Аврор', 'Агап', 'Агей', 'Адам', 'Адий', 'Адольф', 'Адонис', 'Адриан', 'Аким', 'Аксён', 'Алан', 'Алевтин', 'Александр', 'Алексей', 'Алим', 'Альберт', 'Альбин', 'Альвиан', 'Альвин', 'Альфред', 'Амос', 'Ананий', 'Анастасий', 'Анатолий', 'Анвар', 'Андрей', 'Андриан', 'Андрон', 'Анис', 'Анисим', 'Анри', 'Антип', 'Антон', 'Антонин', 'Антуан', 'Аполлинарий', 'Аполлон', 'Арам', 'Арвид', 'Аргент', 'Арефий', 'Арий', 'Аристарх', 'Аркадий', 'Арлен', 'Арнольд', 'Арсен', 'Арсений', 'Артамон', 'Артур', 'Артём', 'Архип', 'Аскольд', 'Афанасий', 'Афиноген', 'Ахмат', 'Баграт', 'Бажен', 'Баян', 'Бенедикт', 'Бернард', 'Бертольд', 'Богдан', 'Боеслав', 'Болеслав', 'Боримир', 'Борис', 'Борислав', 'Боян', 'Бронислав', 'Бруно', 'Будимир', 'Булат', 'Вавила', 'Вадим', 'Валентин', 'Валериан', 'Валерий', 'Вальтер', 'Ванадий', 'Варлам', 'Варлен', 'Вартан', 'Варфоломей', 'Василий', 'Василько', 'Вахтанг', 'Вацлав', 'Велимир', 'Велислав', 'Велор', 'Венедикт', 'Вениамин', 'Вергилий', 'Викентий', 'Виктор', 'Вилен', 'Вилий', 'Вилиор', 'Вилли', 'Вилор', 'Вилорг', 'Виль', 'Вильгельм', 'Вильям', 'Винцент', 'Виолен', 'Виссарион', 'Виталий', 'Витольд', 'Влад', 'Владелин', 'Владилен', 'Владимир', 'Владислав', 'Владлен', 'Влас', 'Воин', 'Воислав', 'Володар', 'Вольдемар', 'Вольмир', 'Вольт', 'Вольфрам', 'Всеволод', 'Всемил', 'Вячеслав', 'Габриель', 'Гавриил', 'Гайдар', 'Галактион', 'Галий', 'Гамлет', 'Гаральд', 'Гарибальди', 'Гарри', 'Гаспар', 'Гвидон', 'Гектор', 'Гелеон', 'Гелиан', 'Гений', 'Геннадий', 'Генрих', 'Геодар', 'Георгий', 'Геральд', 'Герасим', 'Герман', 'Гермоген', 'Геронтий', 'Герт', 'Гертруд', 'Глеб', 'Горазд', 'Гораций', 'Гордей', 'Горимир', 'Горислав', 'Горн', 'Гранит', 'Григорий', 'Гурий', 'Густав', 'Давыд', 'Дамир', 'Дан', 'Даниар', 'Даниил', 'Даниэль', 'Дар', 'Декабрий', 'Дементий', 'Демид', 'Демократ', 'Демьян', 'Денис', 'Джеральд', 'Джозеф', 'Джой', 'Джон', 'Дидим', 'Дин', 'Дионисий', 'Дмитрий', 'Добрыня', 'Дональт', 'Донат', 'Дориан', 'Дорофей', 'Евгений', 'Евграф', 'Евдоким', 'Евлампий', 'Евлогий', 'Евсей', 'Евстафий', 'Егор', 'Елизар', 'Елисей', 'Емельян', 'Епифан', 'Еремей', 'Ермак', 'Ермил', 'Ермолай', 'Ерофей', 'Еруслан', 'Ефим', 'Ефрем', 'Ждан', 'Жерар', 'Жозеф', 'Жорес', 'Захар', 'Зигмунд', 'Зигфрид', 'Зиновий', 'Зорий', 'Зосим', 'Зот', 'Ибрагим', 'Иван', 'Игнатий', 'Игорь', 'Иероним', 'Измаил', 'Изяслав', 'Ий', 'Икар', 'Иларий', 'Илий', 'Илиодор', 'Илларион', 'Илья', 'Иннокентий', 'Иоанн', 'Иосиф', 'Ипатий', 'Ипполит', 'Ираклий', 'Ириней', 'Ирм', 'Исай', 'Исак', 'Исей', 'Исидор', 'Июлий', 'Казимир', 'Калина', 'Камиль', 'Капитон', 'Карен', 'Карл', 'Карм', 'Карп', 'Каспар', 'Касьян', 'Ким', 'Киприан', 'Кир', 'Кирилл', 'Клавдий', 'Клемент', 'Климент', 'Климентий', 'Колумбий', 'Кондратий', 'Конон', 'Конрад', 'Константин', 'Корней', 'Корнелий', 'Корнил', 'Краснослав', 'Кристоф', 'Ксенофонт', 'Кузьма', 'Куприян', 'Курт', 'Кюри', 'Лавр', 'Лаврентий', 'Лазарь', 'Ларион', 'Лаэрт', 'Лев', 'Левкий', 'Лель', 'Ленар', 'Лениан', 'Леон', 'Леонард', 'Леонид', 'Леонтий', 'Леопольд', 'Лермонт', 'Либерт', 'Ливадий', 'Лионель', 'Лир', 'Лор', 'Лоренс', 'Лорис', 'Лоэнгрин', 'Лука', 'Лукьян', 'Любим', 'Любомир', 'Людвиг', 'Люксен', 'Люсьен', 'Маврикий', 'Май', 'Майслав', 'Макар', 'Макс', 'Максим', 'Максимильян', 'Мануил', 'Манфред', 'Марат', 'Мариан', 'Марин', 'Марк', 'Маркел', 'Маркиан', 'Марлен', 'Марс', 'Марсен', 'Мартын', 'Матвей', 'Меркурий', 'Мефодий', 'Мечислав', 'Милад', 'Милан', 'Милен', 'Милий', 'Милонег', 'Милослав', 'Мир', 'Мирон', 'Мирослав', 'Михаил', 'Модест', 'Моисей', 'Монолит', 'Морис', 'Мстислав', 'Мурат', 'Мюд', 'Надир', 'Назар', 'Назим', 'Наль', 'Натан', 'Наум', 'Нельсон', 'Неон', 'Неонил', 'Нестор', 'Никандр', 'Никанор', 'Никита', 'Никифор', 'Никодим', 'Николай', 'Никон', 'Нил', 'Нинел', 'Нисон', 'Нифонт', 'Новомир', 'Нодар', 'Ной', 'Норд', 'Овидий', 'Одиссей', 'Оксар', 'Октавиан', 'Октябрин', 'Октябрь', 'Олег', 'Оливер', 'Олимпий', 'Ольгерд', 'Омар', 'Онисим', 'Орест', 'Осип', 'Оскар', 'Остап', 'Остромир', 'Отто', 'Павел', 'Палладий', 'Пантелеймон', 'Панфил', 'Парамон', 'Партизан', 'Пахом', 'Пересвет', 'Пимен', 'Платон', 'Поликарп', 'Порфирий', 'Потап', 'Пров', 'Прозор', 'Прокофий', 'Протас', 'Прохор', 'Пётр', 'Равель', 'Равиль', 'Радамес', 'Радий', 'Радим', 'Радислав', 'Радомир', 'Раймонд', 'Ральф', 'Рандольф', 'Ратмир', 'Рауль', 'Рафаил', 'Рафаэль', 'Рашид', 'Ревмир', 'Рем', 'Ренальд', 'Ренат', 'Рид', 'Ричард', 'Роальд', 'Роберт', 'Робеспьер', 'Робинзон', 'Родион', 'Рождеро', 'Ролан', 'Роман', 'Ромен', 'Ромуальд', 'Ростислав', 'Рубен', 'Рудольф', 'Рунар', 'Руслан', 'Руссо', 'Рустам', 'Рустем', 'Рэм', 'Рюрик', 'Савва', 'Савелий', 'Самсон', 'Самуил', 'Свет', 'Светлан', 'Светозар', 'Светослав', 'Святогор', 'Святополк', 'Святослав', 'Севастиан', 'Север', 'Северин', 'Северьян', 'Северян', 'Семён', 'Серапион', 'Серафим', 'Сергей', 'Сигизмунд', 'Сидор', 'Сила', 'Сильвест', 'Симон', 'Слава', 'Совет', 'Сократ', 'Соломон', 'Софокл', 'Софон', 'Спартак', 'Спиридон', 'Сталь', 'Станислав', 'Степан', 'Стратон', 'Сурен', 'Таир', 'Тарас', 'Теймураз', 'Тельнан', 'Тенгиз', 'Теодор', 'Терентий', 'Тигран', 'Тимофей', 'Тимур', 'Тит', 'Тихомир', 'Тихон', 'Товий', 'Томас', 'Торез', 'Торий', 'Тристан', 'Трифон', 'Трофим', 'Туллий', 'Ульяна', 'Устин', 'Фадей', 'Фарид', 'Февралин', 'Федор', 'Феликс', 'Феодосий', 'Феофан', 'Фернан', 'Фернанд', 'Фидель', 'Филарет', 'Филат', 'Филимон', 'Филипп', 'Флегонт', 'Флорентий', 'Флоренц', 'Флорин', 'Фома', 'Фотий', 'Франц', 'Фридрих', 'Фрол', 'Фёдор', 'Харитон', 'Храбр', 'Христоф', 'Цезарь', 'Чарлз', 'Чеслав', 'Шамиль', 'Шмидт', 'Эвальд', 'Эдвард', 'Эдвин', 'Эдгар', 'Эдип', 'Эдмунд', 'Эдуард', 'Эйнар', 'Электрон', 'Эль', 'Эльбрус', 'Эльдар', 'Эльмар', 'Эльмир', 'Эмилиан', 'Эмилий', 'Эммануил', 'Энвер', 'Энгель', 'Энергий', 'Эразм', 'Эраст', 'Эрг', 'Эрий', 'Эрик', 'Эрлен', 'Эрнест', 'Ювеналий', 'Юджин', 'Юлиан', 'Юлий', 'Юм', 'Юпитер', 'Юрий', 'Юстин', 'Яков', 'Ян', 'Януарий', 'Яромир', 'Ярополк', 'Ярослав'
    ],

    /*
    |--------------------------------------------------------------------------
    | List of surnames
    |--------------------------------------------------------------------------
    |
    |
    |
    */

    'surnames' => [
        'Андерсен', 'Баер', 'Бернард', 'Берот', 'Богданов', 'Браун', 'Вагнер', 'Ван', 'Васильев', 'Виноградов', 'Волков', 'Вонг', 'Воробьёв', 'Гарсия', 'Голубев', 'Гомес', 'Гонсалес', 'Де Йонг', 'Джексон', 'Дженсен', 'Джесис', 'Джонс', 'Джонсон', 'Дэвис', 'Зайцев', 'Иванов', 'Йылмаз', 'Калинин', 'Керни', 'Ким', 'Козлов', 'Коэн', 'Кузнецов', 'Кушен', 'Лам', 'Ларсен', 'Лебедев', 'Ли', 'Лим', 'Лопес', 'Лёви', 'Майер', 'Марта', 'Мартин', 'Мартинес', 'Миллер', 'Морозов', 'Муньеж', 'Мур', 'Мюллер', 'Нгуен', 'Нельсон', 'Новак', 'Новиков', 'Озолин', 'Павлов', 'Пападопулос', 'Партез', 'Петров', 'Питерс', 'Попов', 'Робинсон', 'Роджиас', 'Родригес', 'Рональдо', 'Росси', 'Семёнов', 'Сильва', 'Смирнов', 'Смит', 'Соколов', 'Соловьёв', 'Судзуки', 'Тан', 'Тейлор', 'Томас', 'Томпсон', 'Траоре', 'Тьеран', 'Уайт', 'Уанг', 'Уилсон', 'Уильямс', 'Фернандес', 'Фитчер', 'Хан', 'Харрис', 'Хатакаси', 'Хван', 'Хендрикс', 'Хуберт', 'Чан', 'Чех', 'Чжан', 'Чё', 'Шахин', 'Эрнандес', 'Якобс', 'Ямомота', 'Янг'
    ],

];
